#
# シミュレーション
# python main_coin_toss.py
#
#   表の出る確率（black_win_rate）が偏ったコインを、指定回数（max_bout_count）投げる
#

import traceback
import datetime
import random
import math

from library import CoinToss


SUMMARY_FILE_PATH = 'main_coin_toss.log'

# 下の式になるような、先手先取本数、後手先取本数を求めたい。
#
#
# 　　　　   先手先取本数
# ───────────────────────────────　＝　先手勝率
# 　先手先取本数　＋　後手先取本数
#
# ここで、先手先取本数、後手先取本数は１以上の整数とし、先手先取本数　≧　後手先取本数。
#
#
# 例：
#
# 　　　７
# ─────────────　＝　０．７
# 　７　＋　３
#
#
# このような数式はすぐに作れる。例えば　先手勝率０．６５なら、
#
# 　　　 ６５
# ─────────────────　＝　０．６５
# 　６５　＋　３５
#
#
#
# 備考。先手先取本数、後手先取本数のどちらかを　１　にすると使いやすそうだが、以下の例のように０．７は作れなくなってしまう
#
# 例：
#　　　　　　 １
#　　　　２＋────
# 　　　　　　３
# ─────────────────────　＝　０．７
# 　　　 １
#   ２＋────　＋　１
# 　　　 ３
#
#
#　　　 　　　　１
# 　　　───────────────　＝　０．７
# 　　　 　　　　　３
#   　　　１　＋　────
# 　　　 　　　　　７
#
# その場合、０．７の代わりに０．６６６６…といった近似値を利用することも考えられる
#
# 　　　２
# ─────────────　＝　０．６６６６…
#   ２　＋　１

# 実験によって求めた値は誤差が少ない（桁が多いから精度が上がっている）
#
# 連続コイントス
# INPUT_DATA = [
#     # black_win_rate black_target_in_bout white_target_in_bout
#     # 先手勝率        先手の何本先取制      後手の何本先取制
#     # -------------- -------------------- --------------------
#     [           0.50,                   1,                   1],
#     [           0.51,                  51,                  49],
#     [           0.52,                  13,                  12],
#     [           0.53,                  53,                  47],
#     [           0.54,                  27,                  23],
#     [           0.55,                  11,                   9],
#     [           0.56,                  14,                  11],
#     [           0.57,                  57,                  43],
#     [           0.58,                   4,                   3],
#     [           0.59,                  59,                  41],
#     [           0.60,                   3,                   2],
#     [           0.61,                  61,                  39],
#     [           0.62,                  31,                  18],
#     [           0.63,                  63,                  37],
#     [           0.64,                  16,                   9],
#     [           0.65,                  13,                   7],
#     [           0.66,                  33,                  17],
#     [           0.67,                  67,                  33],
#     [           0.68,                  17,                   8],
#     [           0.69,                  69,                  31],
#     [           0.70,                   7,                   3],
#     [           0.71,                  71,                  29],
#     [           0.72,                  18,                   7],
#     [           0.73,                  73,                  27],
#     [           0.74,                  37,                  13],
#     [           0.75,                   3,                   1],
#     [           0.76,                  19,                   6],
#     [           0.77,                  77,                  23],
#     [           0.78,                  39,                  11],
#     [           0.79,                  79,                  21],
#     [           0.80,                   4,                   1],
#     [           0.81,                  81,                  19],
#     [           0.82,                  41,                   9],
#     [           0.83,                  83,                  17],
#     [           0.84,                  21,                   4],
#     [           0.85,                  17,                   3],
#     [           0.86,                  43,                   7],
#     [           0.87,                  87,                  13],
#     [           0.88,                  22,                   3],
#     [           0.89,                  89,                  11],
#     [           0.90,                   9,                   1],
#     [           0.91,                  91,                   9],
#     [           0.92,                  23,                   2],
#     [           0.93,                  93,                   7],
#     [           0.94,                  47,                   3],
#     [           0.95,                  19,                   1],
#     [           0.96,                  24,                   1],
#     [           0.97,                  97,                   3],
#     [           0.98,                  49,                   1],
#     [           0.99,                  99,                   1],
# ]

# 理論値
#
# 　　　　   先手先取本数
# ───────────────────────────────　＝　先手勝率
# 　先手先取本数　＋　後手先取本数
#
#
# 理論値は誤差が大きい
#
#       1. 約分して桁が減ることで、精度がさがっているため
#       2. 99:1 だと比は 0.010101... になるが、差が偏っているため
#
INPUT_DATA = [
    # black_win_rate black_target_in_bout white_target_in_bout
    # 先手勝率        先手の何本先取制      後手の何本先取制
    # -------------- -------------------- --------------------
    [           0.50,                   1,                   1],
    [           0.51,                  51,                  49],
    [           0.52,                  13,                  12],
    [           0.53,                  53,                  47],
    [           0.54,                  27,                  23],
    [           0.55,                  11,                   9],
    [           0.56,                  14,                  11],
    [           0.57,                  57,                  43],
    [           0.58,                  29,                  21],
    [           0.59,                  59,                  41],
    [           0.60,                   3,                   2],
    [           0.61,                  61,                  39],
    [           0.62,                  31,                  19],
    [           0.63,                  63,                  37],
    [           0.64,                  16,                   9],
    [           0.65,                  13,                   7],
    [           0.66,                  33,                  17],
    [           0.67,                  67,                  33],
    [           0.68,                  17,                   8],
    [           0.69,                  69,                  31],
    [           0.70,                   7,                   3],
    [           0.71,                  71,                  29],
    [           0.72,                  18,                   7],
    [           0.73,                  73,                  27],
    [           0.74,                  37,                  13],
    [           0.75,                   3,                   1],
    [           0.76,                  19,                   6],
    [           0.77,                  77,                  23],
    [           0.78,                  39,                  11],
    [           0.79,                  79,                  21],
    [           0.80,                   4,                   1],
    [           0.81,                  81,                  19],
    [           0.82,                  41,                   9],
    [           0.83,                  83,                  17],
    [           0.84,                  21,                   4],
    [           0.85,                  17,                   3],
    [           0.86,                  43,                   7],
    [           0.87,                  87,                  13],
    [           0.88,                  22,                   3],
    [           0.89,                  89,                  11],
    [           0.90,                   9,                   1],
    [           0.91,                  91,                   9],
    [           0.92,                  23,                   2],
    [           0.93,                  93,                   7],
    [           0.94,                  47,                   3],
    [           0.95,                  19,                   1],
    [           0.96,                  24,                   1],
    [           0.97,                  97,                   3],
    [           0.98,                  49,                   1],
    [           0.99,                  99,                   1],
]


# INPUT_DATA = [
#     # black_win_rate black_target_in_bout white_target_in_bout
#     # 先手勝率        先手の何本先取制      後手の何本先取制
#     # -------------- -------------------- --------------------
#     [           0.60,                   3,                   2],    #                   先手が勝った確率 47.5357 ％  誤差  2.4643 ％
#     [           0.60,                  30,                  20],    # 精度を１０倍する   先手が勝った確率 49.2292 ％  誤差  0.7708 ％
#     [           0.60,                 300,                 200],    # 精度を１００倍する  先手が勝った確率 49.7886 ％  誤差  0.2114 ％  
# ]


# INPUT_DATA = [
#     # black_win_rate black_target_in_bout white_target_in_bout
#     # 先手勝率        先手の何本先取制      後手の何本先取制
#     # -------------- -------------------- --------------------
# #   [           0.60,                   3,                   2],    # 理論値    先手が勝った確率 47.5010 ％  誤差  2.4990 ％
# #   [           0.60,                   5,                   4],    # 試し      先手が勝った確率 59.4284 ％  誤差  9.4284 ％
# #   [           0.60,                   1,                   1],    # 試し      先手が勝った確率 60.0374 ％  誤差 10.0374 ％
# #   [           0.60,                   7,                   3],    # 試し      先手が勝った確率 23.2082 ％  誤差 26.7918 ％
# #   [           0.60,                   7,                   2],    # 試し      先手が勝った確率 10.6425 ％  誤差 39.3575 ％
# #   [           0.60,                   2,                   1],    # 試し      先手が勝った確率 35.9980 ％  誤差 14.0020 ％
#     [           0.70,                   7,                   3],    # 理論値    先手が勝った確率 46.2845 ％  誤差  3.7155 ％
#     [           0.70,                  14,                   6],    # ２倍      先手が勝った確率 47.3834 ％  誤差  2.6166 ％
#     [           0.70,                   2,                   1],    # 経験則    先手が勝った確率 48.9774 ％  誤差  1.0225 ％    理論値より精度が上がるの、なんで？ なんか収束してる？
# ]


########################################
# コマンドから実行時
########################################


if __name__ == '__main__':
    """コマンドから実行時"""

    try:
        for input_datum in INPUT_DATA:
            coin_toss = CoinToss(summary_file_path=SUMMARY_FILE_PATH)

            # 閏対局を使わないパターン
            coin_toss.coin_toss_in_some_rounds(
                    # 先手勝率
                    black_win_rate=input_datum[0],
                    # 先手の何本先取制
                    black_target_in_bout=input_datum[1],
                    # 後手の何本先取制
                    white_target_in_bout=input_datum[2],
                    # 対局数
                    round_total=2_000_000)

    except Exception as err:
        print(f"[unexpected error] {err=}  {type(err)=}")

        # スタックトレース表示
        print(traceback.format_exc())

        raise
