#
# シミュレーション
# python simulation_coin_toss.py
#
#   表の出る確率（black_win_rate）が偏ったコインを、指定回数（max_bout_count）投げる
#

import traceback
import random
import math

from library import BLACK, CoinToss
from views import write_coin_toss_log


SUMMARY_FILE_PATH = 'output/simulation_coin_toss.log'


# 実験によって求めた値は誤差が少ない（桁が多いから精度が上がっている）
#
# 連続コイントス
# INPUT_DATA = [
#     # p       ... 表が出る確率
#     # b_point ... 先手の何本先取制
#     # w_point ... 後手の何本先取制
#     #
#     #  p      b_point  w_point
#     #  -----  -------  -------
#     [  0.50,       1,        1 ],
#     [  0.51,      51,       49 ],
#     [  0.52,      13,       12 ],
#     [  0.53,      53,       47 ],
#     [  0.54,      27,       23 ],
#     [  0.55,      11,        9 ],
#     [  0.56,      14,       11 ],
#     [  0.57,      57,       43 ],
#     [  0.58,       4,        3 ],
#     [  0.59,      59,       41 ],
#     [  0.60,       3,        2 ],
#     [  0.61,      61,       39 ],
#     [  0.62,      31,       18 ],
#     [  0.63,      63,       37 ],
#     [  0.64,      16,        9 ],
#     [  0.65,      13,        7 ],
#     [  0.66,      33,       17 ],
#     [  0.67,      67,       33 ],
#     [  0.68,      17,        8 ],
#     [  0.69,      69,       31 ],
#     [  0.70,       7,        3 ],
#     [  0.71,      71,       29 ],
#     [  0.72,      18,        7 ],
#     [  0.73,      73,       27 ],
#     [  0.74,      37,       13 ],
#     [  0.75,       3,        1 ],
#     [  0.76,      19,        6 ],
#     [  0.77,      77,       23 ],
#     [  0.78,      39,       11 ],
#     [  0.79,      79,       21 ],
#     [  0.80,       4,        1 ],
#     [  0.81,      81,       19 ],
#     [  0.82,      41,        9 ],
#     [  0.83,      83,       17 ],
#     [  0.84,      21,        4 ],
#     [  0.85,      17,        3 ],
#     [  0.86,      43,        7 ],
#     [  0.87,      87,       13 ],
#     [  0.88,      22,        3 ],
#     [  0.89,      89,       11 ],
#     [  0.90,       9,        1 ],
#     [  0.91,      91,        9 ],
#     [  0.92,      23,        2 ],
#     [  0.93,      93,        7 ],
#     [  0.94,      47,        3 ],
#     [  0.95,      19,        1 ],
#     [  0.96,      24,        1 ],
#     [  0.97,      97,        3 ],
#     [  0.98,      49,        1 ],
#     [  0.99,      99,        1 ],
# ]

# # 理論値　［後手はあと１本取得したら勝つ状況に固定した場合］
# INPUT_DATA = [
#     # p ... 表が出る確率
#     # b ... 表(Black)を選んだ側が勝つのに必要な、表が先取する本数
#     # w ... 裏(White)を選んだ側が勝つのに必要な、裏が先取する本数
#     #
#     #  p      b    w
#     #  ----   --   --
#     [  0.50,   1,   1],
#     [  0.51,   1,   1],
#     [  0.52,   1,   1],
#     [  0.53,   1,   1],
#     [  0.54,   1,   1],
#     [  0.55,   1,   1],
#     [  0.56,   1,   1],
#     [  0.57,   1,   1],
#     [  0.58,   1,   1],
#     [  0.59,   1,   1],
#     [  0.60,   1,   1],
#     [  0.61,   1,   1],
#     [  0.62,   2,   1],
#     [  0.63,   2,   1],
#     [  0.64,   2,   1],
#     [  0.65,   2,   1],
#     [  0.66,   2,   1],
#     [  0.67,   2,   1],
#     [  0.68,   2,   1],
#     [  0.69,   2,   1],
#     [  0.70,   2,   1],
#     [  0.71,   2,   1],
#     [  0.72,   2,   1],
#     [  0.73,   2,   1],
#     [  0.74,   2,   1],
#     [  0.75,   2,   1],
#     [  0.76,   3,   1],
#     [  0.77,   3,   1],
#     [  0.78,   3,   1],
#     [  0.79,   3,   1],
#     [  0.80,   3,   1],
#     [  0.81,   3,   1],
#     [  0.82,   4,   1],
#     [  0.83,   4,   1],
#     [  0.84,   4,   1],
#     [  0.85,   4,   1],
#     [  0.86,   5,   1],
#     [  0.87,   5,   1],
#     [  0.88,   5,   1],
#     [  0.89,   6,   1],
#     [  0.90,   7,   1],
#     [  0.91,   7,   1],
#     [  0.92,   8,   1],
#     [  0.93,  10,   1],
#     [  0.94,  11,   1],
#     [  0.95,  14,   1],
#     [  0.96,  17,   1],
#     [  0.97,  23,   1],
#     [  0.98,  34,   1],
#     [  0.99,  69,   1],
# ]


# ［高橋智史システム］
INPUT_DATA = [
    # p ... 表が出る確率
    # b ... 表(Black)を選んだ側が勝つのに必要な、表が先取する本数
    # w ... 裏(White)を選んだ側が勝つのに必要な、裏が先取する本数
    #
    #  p      b    w
    #  ----   --   --
    [  0.50,   1,   1],
    [  0.51,   1,   1],
    [  0.52,   1,   1],
    [  0.53,   1,   1],
    [  0.54,   1,   1],
    [  0.55,   1,   1],
    [  0.56,   1,   1],
    [  0.57,   1,   1],
    [  0.58,   3,   2],
    [  0.59,   3,   2],
    [  0.60,   3,   2],
    [  0.61,   3,   2],
    [  0.62,   3,   2],
    [  0.63,   3,   2],
    [  0.64,   5,   3],
    [  0.65,   5,   3],
    [  0.66,   7,   4],
    [  0.67,   4,   2],
    [  0.68,   4,   2],
    [  0.69,   2,   1],
    [  0.70,   2,   1],
    [  0.71,   2,   1],
    [  0.72,   2,   1],
    [  0.73,   5,   2],
    [  0.74,   5,   2],
    [  0.75,   5,   2],
    [  0.76,   6,   2],
    [  0.77,   6,   2],
    [  0.78,   3,   1],
    [  0.79,   3,   1],
    [  0.80,   3,   1],
    [  0.81,   3,   1],
    [  0.82,   8,   2],
    [  0.83,   4,   1],
    [  0.84,   4,   1],
    [  0.85,   4,   1],
    [  0.86,   5,   1],
    [  0.87,   5,   1],
    [  0.88,   5,   1],
    [  0.89,   6,   1],
    [  0.90,   7,   1],
    [  0.91,   7,   1],
    [  0.92,   8,   1],
    [  0.93,   9,   1],
    [  0.94,  11,   1],
    [  0.95,  13,   1],
    [  0.96,  16,   1],
    [  0.97,  21,   1],
    [  0.98,  32,   1],
    [  0.99,  64,   1],
]


########################################
# コマンドから実行時
########################################


if __name__ == '__main__':
    """コマンドから実行時"""

    try:
        round_total = 2_000_000

        for input_datum in INPUT_DATA:
            coin_toss = CoinToss(output_file_path=SUMMARY_FILE_PATH)


            # 先手勝率
            black_win_rate=input_datum[0]

            # 先手の何本先取制
            b_point=input_datum[1]

            # 後手の何本先取制
            w_point=input_datum[2]

            # 対局数
            round_total=round_total

            # 黒が勝った回数
            black_wons = 0

            for round in range(0, round_total):
                if coin_toss.coin_toss_in_round(black_win_rate, b_point, w_point) == BLACK:
                    black_wons += 1


            # ログ出力
            write_coin_toss_log(
                    # 出力先ファイルへのパス
                    output_file_path=coin_toss.output_file_path,
                    # 先手勝率
                    black_win_rate=input_datum[0],
                    # 先手の何本先取制
                    b_point=input_datum[1],
                    # 後手の何本先取制
                    w_point=input_datum[2],
                    # 対局数
                    round_total=round_total,
                    # 黒が勝った回数
                    black_wons=black_wons)

    except Exception as err:
        print(f"[unexpected error] {err=}  {type(err)=}")

        # スタックトレース表示
        print(traceback.format_exc())

        raise
